// যখন আমরা কোন অনেক বড় সংখ্যা নিবো তখন js এর মদ্ধে বড় সংখ্যা নেওয়ার একটা মাত্রা আছে এর বেশি নিতে গেলে আপনাকে error দিবে / সঠিক নাম্বার js দিবে না , আর সেই error na খেতে চাইলে / বার সঠিক নাম্বার পেতে চাইলে আপনাকে নাম্বারের পর একটা n বসাতে হবে , যেমন

// js এর ১৫ ডিজিটের পর সঠিক নাম্বার পাওয়া যায় না , তখন আমরা bigInt use করতে পারি

let num = 466465657461344735465654321654465n;
// let num1 = BigInt(466465657461344735465654321654465); এভাবে দিলে ও সঠিক সংখ্যা পাবে না
let num1 = BigInt("466465657461344735465654321654465"); //এভাবে দিলে  সঠিক সংখ্যা পাবে
// let num1 = BigInt(466465657461344735465654321654465n); //এভাবে দিলে  সঠিক সংখ্যা পাবে
console.log(num);
console.log(num1);

// BigInt Multiplication Example
let x = 9007199254740995n;
let y = 9007199254740995n;
let z = x * y;
console.log(z);
