//=========== নিচের sentence এ "sumit" শব্দটি কয়বার ব্যবহার করা হয়েছে ? প্রথমবার "sumit" কত নাম্বার পজিশনে পাওয়া গেছে 


//===== input : linearsSearch(['a', 'b', 'c', 'd', 'c'],'c');
// output : 2 or 'not found'
// problem : linearSearch() function টি  implement করে দেখান 


//================= কোনো array থেকে কি ভাবে সব থেকে বড় string খুজে বের করবেন এবং তার index নাম্বার দেখাবেন 

// =========================== ১-১০০ পর্যন্ত কোন সংখ্যা গুলো ৩,৫ এবং ৩ ও ৫ উভয় সংখ্যা দ্বারা বিভাজ্য তা বের করো 


// === array থেকে false value কিভাবে খুজে বের করে বাদ দিতে পারি 

// === object থেকে false value কিভাবে খুজে বের করে বাদ দিতে পারি 

